#pragma once
#include "Renderer.h"

inline FVertexSimple Quad_vertices[6] = {
	// 윗면을 바라보는 평면 (크기 1x1, UV 포함)
	{ -0.5f, 0.0f,  0.5f,  0.6f, 1.f, 1.f, 1.f,  0.0f, 0.0f }, // 좌상단
	{ 0.5f, 0.0f,  0.5f,  1.f, 0.6f, 1.f, 1.f,  1.0f, 0.0f }, // 우상단
	{ -0.5f, 0.0f, -0.5f,  0.6f, 1.f, 1.f, 1.f,  0.0f, 1.0f }, // 좌하단
	{ -0.5f, 0.0f, -0.5f,  1.f, 1.f, 0.6f, 1.f,  0.0f, 1.0f }, // 좌하단
	{ 0.5f, 0.0f,  0.5f,  0.6f, 1.f, 1.f, 1.f,  1.0f, 0.0f }, // 우상단
	{ 0.5f, 0.0f, -0.5f,  1.f, 1.f, 0.6f, 1.f,  1.0f, 1.0f }  // 우하단
};
